/*----------------------------------------------------------------------*/
/*                                                         		*/
/* Module Name: rmapi							*/
/*                                                         		*/
/* Module Description: implements functions for accessing the RM	*/
/*                                                         		*/
/*----------------------------------------------------------------------*/

#ifndef _RM_RANGE_CHECK 
#define _RM_RANGE_CHECK
#endif

/* Header File List: */
#include <stdlib.h>
#include <time.h>
#include <string.h>
#include <semaphore.h>
#include <errno.h>

#ifdef OS_VXWORKS
#include <vxWorks.h>
#include <semLib.h>
#include <stdio.h>
#include <stdlib.h>
#include <taskLib.h>
#include <intLib.h>
#include <iv.h>
#include <sysLib.h>
#include <cacheLib.h>
#include <vme.h>
#include <vxLib.h>
#else
#include <sys/mman.h>
#include <sys/types.h>
#include <sys/stat.h>
#include <fcntl.h>
#endif

#include "dtt/gdsutil.h"
#include "dtt/gdstask.h"
#include "dtt/hardware.h"
#if defined(OS_VXWORKS) && (RMEM_LAYOUT == 1)
#include "dtt/pci.h"
#endif
#include "dtt/rmapi.h"

#ifdef OS_SOLARIS
#include <rfm2g_api.h>
#include <rfm_io.h>
#include <rfmApi.h>
#include <rfmErrno.h>
#include <unistd.h>
#endif

#ifndef RTLINUX
#include "../drv/mbuf/mbuf.h"
#endif


/* VxWorks BSP functions not prototyped */
#if defined(OS_VXWORKS) && defined (PROCESSOR_BAJA)
   extern STATUS sysVicBlkCopy (char *,char *, int, BOOL, BOOL);
#endif

#define RMAPI_MAXNODE		4

#define VMIC5588_RAM_OFFSET	0x40
#define DMA_THRESHOLD		256*1000000


   static char*		rm[] = {
   (char*) (0),
   (char*) (0),
   (char*) (0),
   (char*) (0)};

   static char*		rmboard[] = {
   (char*) (0),
   (char*) (0),
   (char*) (0),
   (char*) (0)};

   static int		rmsize[] = {0, 0, 0, 0};
   static int 		rmmaster[] = {0, 0, 0, 0};

   struct rmISR_ctrl {
      short		id;
      int		inum;
      int 		level;
      int		vec;
      rmISR		isr;
      void*		arg;
      int		status;
   };
   typedef struct rmISR_ctrl rmISR_ctrl;
   static rmISR_ctrl	rmIntCtrl[RMAPI_MAXNODE][4];
   static rmISR_ctrl*	ctrlISR = NULL;
   static sem_t		semISR;
   static taskID_t	tidISR;
   static int		badData = 0;
   static int		badFIFO = 0;

   char* rmBaseAddress (short ID)
   {
      switch (ID) {
         case 0:
         case 1:
         case 2:
         case 3:
            {
               return rm[ID];
            }
         default:
            {
               return NULL;
            }
      }
   }


   char* rmBoardAddress (short ID)
   {
      switch (ID) {
         case 0:
         case 1:
         case 2:
         case 3:
            {
               return rmboard[ID];
            }
         default:
            {
               return NULL;
            }
      }
   }


   int rmBoardSize (short ID)
   {
      switch (ID) {
         case 0:
         case 1:
         case 2:
         case 3:
            {
               return rmsize[ID];
            }
         default:
            {
               return 0;
            }
      }
   }

#if RMEM_LAYOUT == 0
   static int rmMaster (int ID) 
   {
      switch (ID) {
         case 0:
         case 1:
         case 2:
         case 3:
            {
               return (rmmaster[ID] != 0);
            }
         default:
            {
               return 0;
            }
      }
   
   }
#endif

/*
  Handels interrupts 1,2,3
  records sender and interrupt number
  gives interrupt semaphore
*/
   int rmClearInt (short ID, int* sid, int* inum)
   {
      volatile char* volatile	addr;	/* base address */
   
      addr = rmBoardAddress (ID);
      if (addr == NULL) {
         return -1;
      }
   
      /* toggle the damn led */
   #ifdef DEBUG
      ((RMREGS*) addr)->csr ^= 0x80;
   #endif
   
      *sid = ((RMREGS*) addr)->sid1;
      *inum = 0x0007 & ((RMREGS*) addr)->irs;
   
      return 0;
   }

/*
  Turns the FAIL led on or off
  setting the FAIL led will have no effect on the
  operation of the 5588 board.  The 5588 does not
  set or clear the FAIL led under any circumstances.
*/
   int rmLED (short ID, int led_on)
   {
      volatile char* volatile	addr;	/* base address */
   
      /* get base address */
      addr = rmBoardAddress (ID);
      if (addr == NULL) {
         return -1;
      }
      /* set LED */
      if (led_on) {
         ((RMREGS*) addr)->csr |= 0x80;
      }
      else {
         ((RMREGS*) addr)->csr &= ~(0x80);
      }
   
      return 0;
   }

/*
  Bypasses the current Reflected memory Node
  must have external optical switch installed
*/
   int rmNodeBypass (short ID, int bypass)
   {
      volatile char* volatile	addr;	/* base address */
   
      /* get base address */
      addr = rmBoardAddress (ID);
      if (addr == NULL) {
         return -1;
      }
      /* set bypass */
      if (bypass) {
         ((RMREGS*) addr)->irs |= (0x08);
      }
      else {
         ((RMREGS*) addr)->irs &= ~(0x08);
      }
   
      return 0;
   }

#ifndef OS_VXWORKS

#ifdef OS_SOLARIS
#if RMEM_LAYOUT != 1
# error unsupported
#endif
/*
   There are up to four RFM boards installed in a frame builder computer.
   The devices are:

  Board ID | Device File Name    | IFO RFM loop 
  ------------------------------------------------------
	0   /dev/daqd-rfm	  the 4k 5565 card
	1   /dev/daqd-rfm-aux	  the 4k 5579 card
	2   /dev/daqd-rfm1	  the 2k 5565 card
	3   /dev/daqd-rfm-aux1	  the 2k 5579 card


   TPMan node 0 should map into boards 0 and 1
   node 1 into boards 2 and 3
*/

   /* Reflective memory board handles */
   static unsigned int rfmHandle[4] = {0, 0, 0, 0};

   /* 5565 boards' handles */
   RFM2GHANDLE   rh5565[2];

   int rmInit (short ID)
   {
	static char junk[64 * 1024 *1024];
        volatile void *mem;
	char dev_fname[128];

	/* printf("rmInit(%d)\n", ID); */
	if (ID == 0) strcpy(dev_fname, "/dev/daqd-rfm");
 	else if (ID == 1) strcpy(dev_fname, "/dev/daqd-rfm-aux");
	else if (ID == 2) strcpy(dev_fname, "/dev/daqd-rfm1");
 	else if (ID == 3) strcpy(dev_fname, "/dev/daqd-rfm-aux1");
	else  {
           printf ("rmInit: Illegal board ID %d\n", ID);
           exit(-1);
	}

	if (ID & 1) {
	  /* 5579 board initialization */
	  RFMHANDLE rh = 0;

	  if ((rh = rfmOpen (dev_fname)) == 0) {
                printf("Could not open 5579 reflective memory in %s\n", dev_fname);
                exit(-1);
	  }
	  rfmSetSwapping(rh, rfmSwapSize);
	  mem = rfmRfm(rh)->rfm_ram;
	  /*mem = junk;*/
          printf ("VMIC RFM 5579 (%d) found, mapped at 0x%x\n", ID, (int) mem);
          rfmHandle[ID] = rh->rh_fd;
        } else {
	  /* 5565 board initialization */
	  RFM2GHANDLE   rh = 0;

	  if (RFM2gOpen (dev_fname, &rh) != RFM2G_SUCCESS) {
                printf("Could not open 5565 reflective memory in %s\n", dev_fname);
		if (ID == 2) return -1;
                exit(-1);
	  }
	  /*(void)RFM2gUserMemory(rh, (void **)&mem, 0, 1);*/
	  mem = junk;
  	  /* Set DMA bnd I/O byteswapping */
  	  (void)RFM2gSetDMAByteSwap(rh, 1);
  	  (void)RFM2gSetPIOByteSwap(rh, 1);

          printf ("VMIC RFM 5565 (%d) found, mapped at 0x%x\n", ID, (int) mem);
          rfmHandle[ID] = rh->rh_fd;
	  rh5565[ID >> 1] = rh;
       }
       rmboard[ID] = rm[ID] = (char*)mem;
       rmsize[ID] =  64 * 1024 *1024;
       rmmaster[ID] = 0;
       return 0;
   }
#else

int mbuf_opened = 0;
int mbuf_fd = 0;

   int rmInit (short ID)
   {
      // 0 -- our shared memory
      // 2 -- IPC shared memory
      if (ID == 0 || ID == 2) {
	 int fd;
	 void *addr;
         char fname[128];
	 extern char system_name[PARAM_ENTRY_LEN];

         /*rmboard[ID] = rm[ID] = malloc (rmsize[ID]);*/
         rmmaster[ID] = 0;

#ifndef RTLINUX
	 strcpy(fname, "/dev/mbuf");
	 if (!mbuf_opened) {
	   if ((fd = open (fname, O_RDWR | O_SYNC)) < 0) {
	       fprintf(stderr, "Couldn't open /dev/mbuf read/write\n");
	       _exit(-1);
	   }
	   mbuf_opened = 1;
 	   mbuf_fd = fd;
	 } else fd = mbuf_fd;
	 struct mbuf_request_struct req;
	 if (ID == 0) {
		strcpy(req.name, system_name);
		rmsize[ID] =  64 * 1024 * 1024;
	 } else {
		strcpy(req.name, "ipc");
		rmsize[ID] =  4 * 1024 * 1024;
	 }
	 req.size = rmsize[ID];
         ioctl (fd, IOCTL_MBUF_ALLOCATE, &req);
         //ioctl (fd, IOCTL_MBUF_INFO, &req);

#else
	 rmsize[ID] =  64 * 1024 * 1024 - 5000;
	 if (ID == 0) sprintf(fname, "/rtl_mem_%s", system_name);
	 else strcpy(fname, "/rtl_mem_ipc");

         if ((fd = open(fname, O_RDWR)) < 0) {
           fprintf(stderr, "Couldn't open `%s' read/write\n", fname);
           _exit(-1);
#if 0
	   /* rtl_epics is shared memory partition used for 
	     communication between epics, front end, awg and tpman */
           if ((fd=open("/rtl_epics", O_RDWR))<0) {
                perror("open(\"rtl_epics\")");
                _exit(-1);
           }
#endif
	 }
#endif

         addr = mmap(0, rmsize[ID], PROT_READ | PROT_WRITE, MAP_SHARED, fd, 0);
         if (addr == MAP_FAILED) {
                printf("return was %d\n",errno);
                perror("mmap");
                _exit(-1);
         }
         printf("%s mmapped address is 0x%lx\n", fname, (long)addr);
         rmboard[ID] = rm[ID] = addr;
      }
      else if (ID == 1) {
         rm[ID] = NULL;
         rmboard[ID] = NULL;
         rmsize[ID] = 0;
         rmmaster[ID] = 0;
      } 
      else {
         printf ("rmInit: Illegal board ID\n");
         return -1;
      } 
   #ifdef DEBUG
      printf("RM%i: Node ID: %i -- Shared memory (%s)\n",
            ID, rm[ID] ? "/gds/" : "");
   #endif
      return 0;
   }
#endif


#elif RMEM_LAYOUT == 1

#define TURN_OFF_5565_FAIL	0x80000000

#define MEM_LOCATOR     0x7
#define DMA_LOCATOR     0x4
#define CSR_LOCATOR     0x6

   struct VMIC5565_CSR {
	unsigned char BRV;	/* 0x0 */
	unsigned char BID;	/* 0x1 */
	unsigned char rsv0;     /* 0x2 */
	unsigned char rsv1;     /* 0x3 */
	unsigned char NID;      /* 0x4 */
	unsigned char rsv2;     /* 0x5 */
	unsigned char rsv3;     /* 0x6 */
	unsigned char rsv4;     /* 0x7 */
	unsigned int LCSR1;	/* 0x8 */
	unsigned int rsv5;	/* 0xC */
	unsigned int LISR;	/* 0x10 */
	unsigned int LIER;	/* 0x14 */
	unsigned int NTD;	/* 0x18 */
	unsigned char NTN;	/* 0x1C */
	unsigned char NIC;	/* 0x1D */
   };

   volatile void *findRfm5565 (unsigned short instance, unsigned short locRegister)
   {
      int busId;
      int status;
      unsigned int pmcAdd;

      status = sysFindPciDevice (0x5565, 0x114A, instance, 0, &busId);
      if (status == -1) return (volatile void *) -1;
      else pmcAdd = sysReadPciConfig (busId, status, 0, locRegister);

      if (locRegister == DMA_LOCATOR) pmcAdd += 0x80;

      return (volatile void*) pmcAdd;
   }

#define TURN_OFF_FAIL_LITE      0x80

struct VMIC5579_MEM_REGISTER {
        unsigned char rsv0;     /* 0x0 */
        unsigned char BID;      /* 0x1 */
        unsigned char rsv2;     /* 0x2 */
        unsigned char rsv3;     /* 0x3 */
        unsigned char NID;      /* 0x4 */
        unsigned char rsv5;     /* 0x5 */
        unsigned char rsv6;     /* 0x6 */
        unsigned char rsv7;     /* 0x7 */
        unsigned char IRS;      /* 0x8 */
        unsigned char CSR1;     /* 0x9 */
        unsigned char rsvA;     /* 0xa */
        unsigned char rsvB;     /* 0xb */
        unsigned char CSR2;     /* 0xc */
        unsigned char CSR3;     /* 0xd */
        unsigned char rsvE;     /* 0xe */
        unsigned char rsvF;     /* 0xf */
        unsigned char CMDND;    /* 0x10 */
        unsigned char CMD;      /* 0x11 */
        unsigned char CDR1;     /* 0x12 */
        unsigned char CDR2;     /* 0x13 */
        unsigned char ICSR;     /* 0x14 */
        unsigned char rsv15;    /* 0x15 */
        unsigned char rsv16;    /* 0x16 */
        unsigned char rsv17;    /* 0x17 */
        unsigned char SID1;     /* 0x18 */
        unsigned char IFR1;     /* 0x19 */
        unsigned short IDR1;    /* 0x1a & 0x1b */
        unsigned char SID2;     /* 0x1c */
        unsigned char IFR2;     /* 0x1d */
        unsigned short IDR2;    /* 0x1e & 0x1f */
        unsigned char SID3;     /* 0x20 */
        unsigned char IFR3;     /* 0x21 */
        unsigned short IDR3;    /* 0x22 & 0x23 */
        unsigned long DADD;     /* 0x24 to 0x27 */
        unsigned char EIS;      /* 0x28 */
        unsigned char ECSR3;    /* 0x29 */
        unsigned char rsv2A;    /* 0x2a */
        unsigned char rsv2B;    /* 0x2b */
        unsigned char rsv2C;    /* 0x2c */
        unsigned char MACR;     /* 0x2d */
        unsigned char rsv2E;    /* 0x2e */
        unsigned char rsv2F;    /* 0x2f */
};


   volatile void *findRfm5579 (unsigned short instance)
   {
      int busId;
      int status;
      unsigned int pmcAdd;

      status = sysFindPciDevice(0x5579, 0x114A, instance, 0, &busId);

      if (status == -1) return (volatile void *) -1;
      else pmcAdd = sysReadPciConfig (busId, status, 0, 5);

      return (volatile void*) pmcAdd;
   }

/*
  Initializes the 5565 PMC reflective memory board, rmAPI
*/
   int rmInit (short ID)
   {
      volatile void *mem;

#if TARGET == (TARGET_L1_GDS_AWG1 + 21)
      if (ID == 1)
#else
      if (ID == 0)
#endif
	{
        volatile struct VMIC5565_CSR *regs;
        regs = (volatile struct VMIC5565_CSR *) findRfm5565 (0, CSR_LOCATOR);
        if (-1 == (int) regs) {
           printf ("rmInit: FATAL ERROR; 5565 PMC not installed\n");
           return (ERROR);
        }
        mem = findRfm5565 (0, MEM_LOCATOR);
        regs -> LCSR1 &= ~TURN_OFF_5565_FAIL;
